In [1]:
import numpy as np 
import pandas as pd

In [2]:
df1 = pd.DataFrame() 
df2 = pd.DataFrame()

In [3]:
df1['viewers'] = ["Matthew", "Mark", "Luke", "John"] 
df2['users'] = ["Mark", "John", "Luke", "Matthew", "Peter"]

In [4]:
df1 = df1.assign(views = np.random.normal(100, 100, 4))
df2 = df2.assign(num_houses = [20, np.nan, 1, 2, 7])

In [5]:
df1

   viewers       views
0  Matthew  100.081250
1     Mark  182.394084
2     Luke  189.414844
3     John  141.540542

In [6]:
df2

     users  num_houses
0     Mark        20.0
1     John         NaN
2     Luke         1.0
3  Matthew         2.0
4    Peter         7.0

In [7]:
df = df1.merge(df2, left_on="viewers", right_on="users", how="left")

In [8]:
df

   viewers       views    users  num_houses
0  Matthew  100.081250  Matthew         2.0
1     Mark  182.394084     Mark        20.0
2     Luke  189.414844     Luke         1.0
3     John  141.540542     John         NaN

In [9]:
df.fillna(-1)

   viewers       views    users  num_houses
0  Matthew  100.081250  Matthew         2.0
1     Mark  182.394084     Mark        20.0
2     Luke  189.414844     Luke         1.0
3     John  141.540542     John        -1.0